2.题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，
  低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，
  高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，
  高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，
  求应发放奖金总数？
  
  
  ####my methods
  def bonus(x):
    input('请输入当月利润: {0}'.format(x))
    if 0 < x <= 10:
        print('应发放奖金总数: {0}'.format(0.1*x))
    elif 10 < x <= 20:
        print('应发放奖金总数: {0}'.format(10*0.1+(x-10)*0.075))
    elif 20 < x <= 40:
        print('应发放奖金总数: {0}'.format(10*0.1+10*0.075+(x-20)*0.05))
    elif 40 < x <= 60:
        print('应发放奖金总数: {0}'.format(10*0.1+10*0.075+20*0.05+(x-40)*0.03))
    elif 60 < x <= 100:
        print('应发放奖金总数: {0}'.format(10*0.1+10*0.075+20*0.05+20*0.03+(x-60)*0.015))
    elif 100 < x:
        print('应发放奖金总数: {0}'.format(10*0.1+10*0.075+20*0.05+20*0.03+40*0.015+(x-100)*0.01))


bonus(56)


## 答案解法

 i = int(input('净利润:'))
arr = [1000000, 600000, 400000, 200000, 100000, 0]
rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
r = 0

for idx in range(0, 6):
    if i > arr[idx]:
        r += (i-arr[idx])*rat[idx]
        print((i-arr[idx])*rat[idx])
        i = arr[idx]
print(r)


bonus = 0
profit = int(input('请输入该月利润：'))

arr =      [100,   60,   40,   20,    10, 0]
rate = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]

for idx in range(0, 6):
    if profit > arr[idx]:
        bonus += (profit-arr[idx])*rate[idx]
        profit = arr[idx]
print(bonus)



  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
